GopalSaraf/Practicals/PSDL/include/proc/pic18lf47j53.inc
// Register: CCPR10H
#define CCPR10H CCPR10H
CCPR10H                                  equ 0F02h
// bitfield definitions
CCPR10H_CCPR10H_POSN                     equ 0000h
CCPR10H_CCPR10H_POSITION                 equ 0000h
CCPR10H_CCPR10H_SIZE                     equ 0008h
CCPR10H_CCPR10H_LENGTH                   equ 0008h
CCPR10H_CCPR10H_MASK                     equ 00FFh

// Register: CCP9CON
#define CCP9CON CCP9CON
CCP9CON                                  equ 0F03h
// bitfield definitions
CCP9CON_CCP9M_POSN                       equ 0000h
CCP9CON_CCP9M_POSITION                   equ 0000h
CCP9CON_CCP9M_SIZE                       equ 0004h
CCP9CON_CCP9M_LENGTH                     equ 0004h
CCP9CON_CCP9M_MASK                       equ 000Fh
CCP9CON_DC9B_POSN                        equ 0004h
CCP9CON_DC9B_POSITION                    equ 0004h
CCP9CON_DC9B_SIZE                        equ 0002h
CCP9CON_DC9B_LENGTH                      equ 0002h
CCP9CON_DC9B_MASK                        equ 0030h
CCP9CON_CCP9M0_POSN                      equ 0000h
CCP9CON_CCP9M0_POSITION                  equ 0000h
CCP9CON_CCP9M0_SIZE                      equ 0001h
CCP9CON_CCP9M0_LENGTH                    equ 0001h
CCP9CON_CCP9M0_MASK                      equ 0001h
CCP9CON_CCP9M1_POSN                      equ 0001h
CCP9CON_CCP9M1_POSITION                  equ 0001h
CCP9CON_CCP9M1_SIZE                      equ 0001h
CCP9CON_CCP9M1_LENGTH                    equ 0001h
CCP9CON_CCP9M1_MASK                      equ 0002h
CCP9CON_CCP9M2_POSN                      equ 0002h
CCP9CON_CCP9M2_POSITION                  equ 0002h
CCP9CON_CCP9M2_SIZE                      equ 0001h
CCP9CON_CCP9M2_LENGTH                    equ 0001h
CCP9CON_CCP9M2_MASK                      equ 0004h
CCP9CON_CCP9M3_POSN                      equ 0003h
CCP9CON_CCP9M3_POSITION                  equ 0003h
CCP9CON_CCP9M3_SIZE                      equ 0001h
CCP9CON_CCP9M3_LENGTH                    equ 0001h
CCP9CON_CCP9M3_MASK                      equ 0008h
CCP9CON_DC9B0_POSN                       equ 0004h
CCP9CON_DC9B0_POSITION                   equ 0004h
CCP9CON_DC9B0_SIZE                       equ 0001h
CCP9CON_DC9B0_LENGTH                     equ 0001h
CCP9CON_DC9B0_MASK                       equ 0010h
CCP9CON_DC9B1_POSN                       equ 0005h
CCP9CON_DC9B1_POSITION                   equ 0005h
CCP9CON_DC9B1_SIZE                       equ 0001h
CCP9CON_DC9B1_LENGTH                     equ 0001h
CCP9CON_DC9B1_MASK                       equ 0020h

// Register: CCPR9L
#define CCPR9L CCPR9L
CCPR9L                                   equ 0F04h
// bitfield definitions
CCPR9L_CCPR9L_POSN                       equ 0000h
CCPR9L_CCPR9L_POSITION                   equ 0000h
CCPR9L_CCPR9L_SIZE                       equ 0008h
CCPR9L_CCPR9L_LENGTH                     equ 0008h
CCPR9L_CCPR9L_MASK                       equ 00FFh

// Register: CCPR9H
#define CCPR9H CCPR9H
CCPR9H                                   equ 0F05h
// bitfield definitions
CCPR9H_CCPR9H_POSN                       equ 0000h
CCPR9H_CCPR9H_POSITION                   equ 0000h
CCPR9H_CCPR9H_SIZE                       equ 0008h
CCPR9H_CCPR9H_LENGTH                     equ 0008h
CCPR9H_CCPR9H_MASK                       equ 00FFh

// Register: CCP8CON
#define CCP8CON CCP8CON
CCP8CON                                  equ 0F06h
// bitfield definitions
CCP8CON_CCP8M_POSN                       equ 0000h
CCP8CON_CCP8M_POSITION                   equ 0000h
CCP8CON_CCP8M_SIZE                       equ 0004h
CCP8CON_CCP8M_LENGTH                     equ 0004h
CCP8CON_CCP8M_MASK                       equ 000Fh
CCP8CON_DC8B_POSN                        equ 0004h
CCP8CON_DC8B_POSITION                    equ 0004h
CCP8CON_DC8B_SIZE                        equ 0002h
CCP8CON_DC8B_LENGTH                      equ 0002h
CCP8CON_DC8B_MASK                        equ 0030h
CCP8CON_CCP8M0_POSN                      equ 0000h
CCP8CON_CCP8M0_POSITION                  equ 0000h
CCP8CON_CCP8M0_SIZE                      equ 0001h
CCP8CON_CCP8M0_LENGTH                    equ 0001h
CCP8CON_CCP8M0_MASK                      equ 0001h
CCP8CON_CCP8M1_POSN                      equ 0001h
CCP8CON_CCP8M1_POSITION                  equ 0001h
CCP8CON_CCP8M1_SIZE                      equ 0001h
CCP8CON_CCP8M1_LENGTH                    equ 0001h
CCP8CON_CCP8M1_MASK                      equ 0002h
CCP8CON_CCP8M2_POSN                      equ 0002h
CCP8CON_CCP8M2_POSITION                  equ 0002h
CCP8CON_CCP8M2_SIZE                      equ 0001h
CCP8CON_CCP8M2_LENGTH                    equ 0001h
CCP8CON_CCP8M2_MASK                      equ 0004h
CCP8CON_CCP8M3_POSN                      equ 0003h
CCP8CON_CCP8M3_POSITION                  equ 0003h
CCP8CON_CCP8M3_SIZE                      equ 0001h
CCP8CON_CCP8M3_LENGTH                    equ 0001h
CCP8CON_CCP8M3_MASK                      equ 0008h
CCP8CON_DC8B0_POSN                       equ 0004h
CCP8CON_DC8B0_POSITION                   equ 0004h
CCP8CON_DC8B0_SIZE                       equ 0001h
CCP8CON_DC8B0_LENGTH                     equ 0001h
CCP8CON_DC8B0_MASK                       equ 0010h
CCP8CON_DC8B1_POSN                       equ 0005h
CCP8CON_DC8B1_POSITION                   equ 0005h
CCP8CON_DC8B1_SIZE                       equ 0001h
CCP8CON_DC8B1_LENGTH                     equ 0001h
CCP8CON_DC8B1_MASK                       equ 0020h

// Register: CCPR8L
#define CCPR8L CCPR8L
CCPR8L                                   equ 0F07h
// bitfield definitions
CCPR8L_CCPR8L_POSN                       equ 0000h
CCPR8L_CCPR8L_POSITION                   equ 0000h
CCPR8L_CCPR8L_SIZE                       equ 0008h
CCPR8L_CCPR8L_LENGTH                     equ 0008h
CCPR8L_CCPR8L_MASK                       equ 00FFh

// Register: CCPR8H
#define CCPR8H CCPR8H
CCPR8H                                   equ 0F08h
// bitfield definitions
CCPR8H_CCPR8H_POSN                       equ 0000h
CCPR8H_CCPR8H_POSITION                   equ 0000h
CCPR8H_CCPR8H_SIZE                       equ 0008h
CCPR8H_CCPR8H_LENGTH                     equ 0008h
CCPR8H_CCPR8H_MASK                       equ 00FFh

// Register: CCP7CON
#define CCP7CON CCP7CON
CCP7CON                                  equ 0F09h
// bitfield definitions
CCP7CON_CCP7M_POSN                       equ 0000h
CCP7CON_CCP7M_POSITION                   equ 0000h
CCP7CON_CCP7M_SIZE                       equ 0004h
CCP7CON_CCP7M_LENGTH                     equ 0004h
CCP7CON_CCP7M_MASK                       equ 000Fh
CCP7CON_DC7B_POSN                        equ 0004h
CCP7CON_DC7B_POSITION                    equ 0004h
CCP7CON_DC7B_SIZE                        equ 0002h
CCP7CON_DC7B_LENGTH                      equ 0002h
CCP7CON_DC7B_MASK                        equ 0030h
CCP7CON_CCP7M0_POSN                      equ 0000h
CCP7CON_CCP7M0_POSITION                  equ 0000h
CCP7CON_CCP7M0_SIZE                      equ 0001h
CCP7CON_CCP7M0_LENGTH                    equ 0001h
CCP7CON_CCP7M0_MASK                      equ 0001h
CCP7CON_CCP7M1_POSN                      equ 0001h
CCP7CON_CCP7M1_POSITION                  equ 0001h
CCP7CON_CCP7M1_SIZE                      equ 0001h
CCP7CON_CCP7M1_LENGTH                    equ 0001h
CCP7CON_CCP7M1_MASK                      equ 0002h
CCP7CON_CCP7M2_POSN                      equ 0002h
CCP7CON_CCP7M2_POSITION                  equ 0002h
CCP7CON_CCP7M2_SIZE                      equ 0001h
CCP7CON_CCP7M2_LENGTH                    equ 0001h
CCP7CON_CCP7M2_MASK                      equ 0004h
CCP7CON_CCP7M3_POSN                      equ 0003h
CCP7CON_CCP7M3_POSITION                  equ 0003h
CCP7CON_CCP7M3_SIZE                      equ 0001h
CCP7CON_CCP7M3_LENGTH                    equ 0001h
CCP7CON_CCP7M3_MASK                      equ 0008h
CCP7CON_DC7B0_POSN                       equ 0004h
CCP7CON_DC7B0_POSITION                   equ 0004h
CCP7CON_DC7B0_SIZE                       equ 0001h
CCP7CON_DC7B0_LENGTH                     equ 0001h
CCP7CON_DC7B0_MASK                       equ 0010h
CCP7CON_DC7B1_POSN                       equ 0005h
CCP7CON_DC7B1_POSITION                   equ 0005h
CCP7CON_DC7B1_SIZE                       equ 0001h
CCP7CON_DC7B1_LENGTH                     equ 0001h
CCP7CON_DC7B1_MASK                       equ 0020h

