GopalSaraf/Practicals/PSDL/include/proc/pic18lf47j53.inc
// Register: ALRMVALH
#define ALRMVALH ALRMVALH
ALRMVALH                                 equ 0F45h
// bitfield definitions
ALRMVALH_ALRMVALH_POSN                   equ 0000h
ALRMVALH_ALRMVALH_POSITION               equ 0000h
ALRMVALH_ALRMVALH_SIZE                   equ 0008h
ALRMVALH_ALRMVALH_LENGTH                 equ 0008h
ALRMVALH_ALRMVALH_MASK                   equ 00FFh

// Register: ALRMRPT
#define ALRMRPT ALRMRPT
ALRMRPT                                  equ 0F46h
// bitfield definitions
ALRMRPT_ARPT_POSN                        equ 0000h
ALRMRPT_ARPT_POSITION                    equ 0000h
ALRMRPT_ARPT_SIZE                        equ 0008h
ALRMRPT_ARPT_LENGTH                      equ 0008h
ALRMRPT_ARPT_MASK                        equ 00FFh
ALRMRPT_ARPT0_POSN                       equ 0000h
ALRMRPT_ARPT0_POSITION                   equ 0000h
ALRMRPT_ARPT0_SIZE                       equ 0001h
ALRMRPT_ARPT0_LENGTH                     equ 0001h
ALRMRPT_ARPT0_MASK                       equ 0001h
ALRMRPT_ARPT1_POSN                       equ 0001h
ALRMRPT_ARPT1_POSITION                   equ 0001h
ALRMRPT_ARPT1_SIZE                       equ 0001h
ALRMRPT_ARPT1_LENGTH                     equ 0001h
ALRMRPT_ARPT1_MASK                       equ 0002h
ALRMRPT_ARPT2_POSN                       equ 0002h
ALRMRPT_ARPT2_POSITION                   equ 0002h
ALRMRPT_ARPT2_SIZE                       equ 0001h
ALRMRPT_ARPT2_LENGTH                     equ 0001h
ALRMRPT_ARPT2_MASK                       equ 0004h
ALRMRPT_ARPT3_POSN                       equ 0003h
ALRMRPT_ARPT3_POSITION                   equ 0003h
ALRMRPT_ARPT3_SIZE                       equ 0001h
ALRMRPT_ARPT3_LENGTH                     equ 0001h
ALRMRPT_ARPT3_MASK                       equ 0008h
ALRMRPT_ARPT4_POSN                       equ 0004h
ALRMRPT_ARPT4_POSITION                   equ 0004h
ALRMRPT_ARPT4_SIZE                       equ 0001h
ALRMRPT_ARPT4_LENGTH                     equ 0001h
ALRMRPT_ARPT4_MASK                       equ 0010h
ALRMRPT_ARPT5_POSN                       equ 0005h
ALRMRPT_ARPT5_POSITION                   equ 0005h
ALRMRPT_ARPT5_SIZE                       equ 0001h
ALRMRPT_ARPT5_LENGTH                     equ 0001h
ALRMRPT_ARPT5_MASK                       equ 0020h
ALRMRPT_ARPT6_POSN                       equ 0006h
ALRMRPT_ARPT6_POSITION                   equ 0006h
ALRMRPT_ARPT6_SIZE                       equ 0001h
ALRMRPT_ARPT6_LENGTH                     equ 0001h
ALRMRPT_ARPT6_MASK                       equ 0040h
ALRMRPT_ARPT7_POSN                       equ 0007h
ALRMRPT_ARPT7_POSITION                   equ 0007h
ALRMRPT_ARPT7_SIZE                       equ 0001h
ALRMRPT_ARPT7_LENGTH                     equ 0001h
ALRMRPT_ARPT7_MASK                       equ 0080h

// Register: ALRMCFG
#define ALRMCFG ALRMCFG
ALRMCFG                                  equ 0F47h
// bitfield definitions
ALRMCFG_ALRMPTR_POSN                     equ 0000h
ALRMCFG_ALRMPTR_POSITION                 equ 0000h
ALRMCFG_ALRMPTR_SIZE                     equ 0002h
ALRMCFG_ALRMPTR_LENGTH                   equ 0002h
ALRMCFG_ALRMPTR_MASK                     equ 0003h
ALRMCFG_AMASK_POSN                       equ 0002h
ALRMCFG_AMASK_POSITION                   equ 0002h
ALRMCFG_AMASK_SIZE                       equ 0004h
ALRMCFG_AMASK_LENGTH                     equ 0004h
ALRMCFG_AMASK_MASK                       equ 003Ch
ALRMCFG_CHIME_POSN                       equ 0006h
ALRMCFG_CHIME_POSITION                   equ 0006h
ALRMCFG_CHIME_SIZE                       equ 0001h
ALRMCFG_CHIME_LENGTH                     equ 0001h
ALRMCFG_CHIME_MASK                       equ 0040h
ALRMCFG_ALRMEN_POSN                      equ 0007h
ALRMCFG_ALRMEN_POSITION                  equ 0007h
ALRMCFG_ALRMEN_SIZE                      equ 0001h
ALRMCFG_ALRMEN_LENGTH                    equ 0001h
ALRMCFG_ALRMEN_MASK                      equ 0080h
ALRMCFG_ALRMPTR0_POSN                    equ 0000h
ALRMCFG_ALRMPTR0_POSITION                equ 0000h
ALRMCFG_ALRMPTR0_SIZE                    equ 0001h
ALRMCFG_ALRMPTR0_LENGTH                  equ 0001h
ALRMCFG_ALRMPTR0_MASK                    equ 0001h
ALRMCFG_ALRMPTR1_POSN                    equ 0001h
ALRMCFG_ALRMPTR1_POSITION                equ 0001h
ALRMCFG_ALRMPTR1_SIZE                    equ 0001h
ALRMCFG_ALRMPTR1_LENGTH                  equ 0001h
ALRMCFG_ALRMPTR1_MASK                    equ 0002h
ALRMCFG_AMASK0_POSN                      equ 0002h
ALRMCFG_AMASK0_POSITION                  equ 0002h
ALRMCFG_AMASK0_SIZE                      equ 0001h
ALRMCFG_AMASK0_LENGTH                    equ 0001h
ALRMCFG_AMASK0_MASK                      equ 0004h
ALRMCFG_AMASK1_POSN                      equ 0003h
ALRMCFG_AMASK1_POSITION                  equ 0003h
ALRMCFG_AMASK1_SIZE                      equ 0001h
ALRMCFG_AMASK1_LENGTH                    equ 0001h
ALRMCFG_AMASK1_MASK                      equ 0008h
ALRMCFG_AMASK2_POSN                      equ 0004h
ALRMCFG_AMASK2_POSITION                  equ 0004h
ALRMCFG_AMASK2_SIZE                      equ 0001h
ALRMCFG_AMASK2_LENGTH                    equ 0001h
ALRMCFG_AMASK2_MASK                      equ 0010h
ALRMCFG_AMASK3_POSN                      equ 0005h
ALRMCFG_AMASK3_POSITION                  equ 0005h
ALRMCFG_AMASK3_SIZE                      equ 0001h
ALRMCFG_AMASK3_LENGTH                    equ 0001h
ALRMCFG_AMASK3_MASK                      equ 0020h

// Register: ANCON0
#define ANCON0 ANCON0
ANCON0                                   equ 0F48h
// bitfield definitions
ANCON0_PCFG0_POSN                        equ 0000h
ANCON0_PCFG0_POSITION                    equ 0000h
ANCON0_PCFG0_SIZE                        equ 0001h
ANCON0_PCFG0_LENGTH                      equ 0001h
ANCON0_PCFG0_MASK                        equ 0001h
ANCON0_PCFG1_POSN                        equ 0001h
ANCON0_PCFG1_POSITION                    equ 0001h
ANCON0_PCFG1_SIZE                        equ 0001h
ANCON0_PCFG1_LENGTH                      equ 0001h
ANCON0_PCFG1_MASK                        equ 0002h
ANCON0_PCFG2_POSN                        equ 0002h
ANCON0_PCFG2_POSITION                    equ 0002h
ANCON0_PCFG2_SIZE                        equ 0001h
ANCON0_PCFG2_LENGTH                      equ 0001h
ANCON0_PCFG2_MASK                        equ 0004h
ANCON0_PCFG3_POSN                        equ 0003h
ANCON0_PCFG3_POSITION                    equ 0003h
ANCON0_PCFG3_SIZE                        equ 0001h
ANCON0_PCFG3_LENGTH                      equ 0001h
ANCON0_PCFG3_MASK                        equ 0008h
ANCON0_PCFG4_POSN                        equ 0004h
ANCON0_PCFG4_POSITION                    equ 0004h
ANCON0_PCFG4_SIZE                        equ 0001h
ANCON0_PCFG4_LENGTH                      equ 0001h
ANCON0_PCFG4_MASK                        equ 0010h
ANCON0_PCFG5_POSN                        equ 0005h
ANCON0_PCFG5_POSITION                    equ 0005h
ANCON0_PCFG5_SIZE                        equ 0001h
ANCON0_PCFG5_LENGTH                      equ 0001h
ANCON0_PCFG5_MASK                        equ 0020h
ANCON0_PCFG6_POSN                        equ 0006h
ANCON0_PCFG6_POSITION                    equ 0006h
ANCON0_PCFG6_SIZE                        equ 0001h
ANCON0_PCFG6_LENGTH                      equ 0001h
ANCON0_PCFG6_MASK                        equ 0040h
ANCON0_PCFG7_POSN                        equ 0007h
ANCON0_PCFG7_POSITION                    equ 0007h
ANCON0_PCFG7_SIZE                        equ 0001h
ANCON0_PCFG7_LENGTH                      equ 0001h
ANCON0_PCFG7_MASK                        equ 0080h

// Register: ANCON1
#define ANCON1 ANCON1
ANCON1                                   equ 0F49h
// bitfield definitions
ANCON1_PCFG8_POSN                        equ 0000h
ANCON1_PCFG8_POSITION                    equ 0000h
ANCON1_PCFG8_SIZE                        equ 0001h
ANCON1_PCFG8_LENGTH                      equ 0001h
ANCON1_PCFG8_MASK                        equ 0001h
ANCON1_PCFG9_POSN                        equ 0001h
ANCON1_PCFG9_POSITION                    equ 0001h
ANCON1_PCFG9_SIZE                        equ 0001h
ANCON1_PCFG9_LENGTH                      equ 0001h
ANCON1_PCFG9_MASK                        equ 0002h
ANCON1_PCFG10_POSN                       equ 0002h
ANCON1_PCFG10_POSITION                   equ 0002h
ANCON1_PCFG10_SIZE                       equ 0001h
ANCON1_PCFG10_LENGTH                     equ 0001h
ANCON1_PCFG10_MASK                       equ 0004h
ANCON1_PCFG11_POSN                       equ 0003h
ANCON1_PCFG11_POSITION                   equ 0003h
ANCON1_PCFG11_SIZE                       equ 0001h
ANCON1_PCFG11_LENGTH                     equ 0001h
ANCON1_PCFG11_MASK                       equ 0008h
ANCON1_PCFG12_POSN                       equ 0004h
ANCON1_PCFG12_POSITION                   equ 0004h
ANCON1_PCFG12_SIZE                       equ 0001h
ANCON1_PCFG12_LENGTH                     equ 0001h
ANCON1_PCFG12_MASK                       equ 0010h
ANCON1_VBGEN_POSN                        equ 0007h
ANCON1_VBGEN_POSITION                    equ 0007h
ANCON1_VBGEN_SIZE                        equ 0001h
ANCON1_VBGEN_LENGTH                      equ 0001h
ANCON1_VBGEN_MASK                        equ 0080h
ANCON1_PCFG15_POSN                       equ 0007h
ANCON1_PCFG15_POSITION                   equ 0007h
ANCON1_PCFG15_SIZE                       equ 0001h
ANCON1_PCFG15_LENGTH                     equ 0001h
ANCON1_PCFG15_MASK                       equ 0080h

