GopalSaraf/Practicals/PSDL/include/proc/pic18lf47j53.inc
// Register: PIE4
#define PIE4 PIE4
PIE4                                     equ 0F8Eh
// bitfield definitions
PIE4_CCP3IE_POSN                         equ 0000h
PIE4_CCP3IE_POSITION                     equ 0000h
PIE4_CCP3IE_SIZE                         equ 0001h
PIE4_CCP3IE_LENGTH                       equ 0001h
PIE4_CCP3IE_MASK                         equ 0001h
PIE4_CCP4IE_POSN                         equ 0001h
PIE4_CCP4IE_POSITION                     equ 0001h
PIE4_CCP4IE_SIZE                         equ 0001h
PIE4_CCP4IE_LENGTH                       equ 0001h
PIE4_CCP4IE_MASK                         equ 0002h
PIE4_CCP5IE_POSN                         equ 0002h
PIE4_CCP5IE_POSITION                     equ 0002h
PIE4_CCP5IE_SIZE                         equ 0001h
PIE4_CCP5IE_LENGTH                       equ 0001h
PIE4_CCP5IE_MASK                         equ 0004h
PIE4_CCP6IE_POSN                         equ 0003h
PIE4_CCP6IE_POSITION                     equ 0003h
PIE4_CCP6IE_SIZE                         equ 0001h
PIE4_CCP6IE_LENGTH                       equ 0001h
PIE4_CCP6IE_MASK                         equ 0008h
PIE4_CCP7IE_POSN                         equ 0004h
PIE4_CCP7IE_POSITION                     equ 0004h
PIE4_CCP7IE_SIZE                         equ 0001h
PIE4_CCP7IE_LENGTH                       equ 0001h
PIE4_CCP7IE_MASK                         equ 0010h
PIE4_CCP8IE_POSN                         equ 0005h
PIE4_CCP8IE_POSITION                     equ 0005h
PIE4_CCP8IE_SIZE                         equ 0001h
PIE4_CCP8IE_LENGTH                       equ 0001h
PIE4_CCP8IE_MASK                         equ 0020h
PIE4_CCP9IE_POSN                         equ 0006h
PIE4_CCP9IE_POSITION                     equ 0006h
PIE4_CCP9IE_SIZE                         equ 0001h
PIE4_CCP9IE_LENGTH                       equ 0001h
PIE4_CCP9IE_MASK                         equ 0040h
PIE4_CCP10IE_POSN                        equ 0007h
PIE4_CCP10IE_POSITION                    equ 0007h
PIE4_CCP10IE_SIZE                        equ 0001h
PIE4_CCP10IE_LENGTH                      equ 0001h
PIE4_CCP10IE_MASK                        equ 0080h

// Register: PIR4
#define PIR4 PIR4
PIR4                                     equ 0F8Fh
// bitfield definitions
PIR4_CCP3IF_POSN                         equ 0000h
PIR4_CCP3IF_POSITION                     equ 0000h
PIR4_CCP3IF_SIZE                         equ 0001h
PIR4_CCP3IF_LENGTH                       equ 0001h
PIR4_CCP3IF_MASK                         equ 0001h
PIR4_CCP4IF_POSN                         equ 0001h
PIR4_CCP4IF_POSITION                     equ 0001h
PIR4_CCP4IF_SIZE                         equ 0001h
PIR4_CCP4IF_LENGTH                       equ 0001h
PIR4_CCP4IF_MASK                         equ 0002h
PIR4_CCP5IF_POSN                         equ 0002h
PIR4_CCP5IF_POSITION                     equ 0002h
PIR4_CCP5IF_SIZE                         equ 0001h
PIR4_CCP5IF_LENGTH                       equ 0001h
PIR4_CCP5IF_MASK                         equ 0004h
PIR4_CCP6IF_POSN                         equ 0003h
PIR4_CCP6IF_POSITION                     equ 0003h
PIR4_CCP6IF_SIZE                         equ 0001h
PIR4_CCP6IF_LENGTH                       equ 0001h
PIR4_CCP6IF_MASK                         equ 0008h
PIR4_CCP7IF_POSN                         equ 0004h
PIR4_CCP7IF_POSITION                     equ 0004h
PIR4_CCP7IF_SIZE                         equ 0001h
PIR4_CCP7IF_LENGTH                       equ 0001h
PIR4_CCP7IF_MASK                         equ 0010h
PIR4_CCP8IF_POSN                         equ 0005h
PIR4_CCP8IF_POSITION                     equ 0005h
PIR4_CCP8IF_SIZE                         equ 0001h
PIR4_CCP8IF_LENGTH                       equ 0001h
PIR4_CCP8IF_MASK                         equ 0020h
PIR4_CCP9IF_POSN                         equ 0006h
PIR4_CCP9IF_POSITION                     equ 0006h
PIR4_CCP9IF_SIZE                         equ 0001h
PIR4_CCP9IF_LENGTH                       equ 0001h
PIR4_CCP9IF_MASK                         equ 0040h
PIR4_CCP10IF_POSN                        equ 0007h
PIR4_CCP10IF_POSITION                    equ 0007h
PIR4_CCP10IF_SIZE                        equ 0001h
PIR4_CCP10IF_LENGTH                      equ 0001h
PIR4_CCP10IF_MASK                        equ 0080h

// Register: IPR4
#define IPR4 IPR4
IPR4                                     equ 0F90h
// bitfield definitions
IPR4_CCP3IP_POSN                         equ 0000h
IPR4_CCP3IP_POSITION                     equ 0000h
IPR4_CCP3IP_SIZE                         equ 0001h
IPR4_CCP3IP_LENGTH                       equ 0001h
IPR4_CCP3IP_MASK                         equ 0001h
IPR4_CCP4IP_POSN                         equ 0001h
IPR4_CCP4IP_POSITION                     equ 0001h
IPR4_CCP4IP_SIZE                         equ 0001h
IPR4_CCP4IP_LENGTH                       equ 0001h
IPR4_CCP4IP_MASK                         equ 0002h
IPR4_CCP5IP_POSN                         equ 0002h
IPR4_CCP5IP_POSITION                     equ 0002h
IPR4_CCP5IP_SIZE                         equ 0001h
IPR4_CCP5IP_LENGTH                       equ 0001h
IPR4_CCP5IP_MASK                         equ 0004h
IPR4_CCP6IP_POSN                         equ 0003h
IPR4_CCP6IP_POSITION                     equ 0003h
IPR4_CCP6IP_SIZE                         equ 0001h
IPR4_CCP6IP_LENGTH                       equ 0001h
IPR4_CCP6IP_MASK                         equ 0008h
IPR4_CCP7IP_POSN                         equ 0004h
IPR4_CCP7IP_POSITION                     equ 0004h
IPR4_CCP7IP_SIZE                         equ 0001h
IPR4_CCP7IP_LENGTH                       equ 0001h
IPR4_CCP7IP_MASK                         equ 0010h
IPR4_CCP8IP_POSN                         equ 0005h
IPR4_CCP8IP_POSITION                     equ 0005h
IPR4_CCP8IP_SIZE                         equ 0001h
IPR4_CCP8IP_LENGTH                       equ 0001h
IPR4_CCP8IP_MASK                         equ 0020h
IPR4_CCP9IP_POSN                         equ 0006h
IPR4_CCP9IP_POSITION                     equ 0006h
IPR4_CCP9IP_SIZE                         equ 0001h
IPR4_CCP9IP_LENGTH                       equ 0001h
IPR4_CCP9IP_MASK                         equ 0040h
IPR4_CCP10IP_POSN                        equ 0007h
IPR4_CCP10IP_POSITION                    equ 0007h
IPR4_CCP10IP_SIZE                        equ 0001h
IPR4_CCP10IP_LENGTH                      equ 0001h
IPR4_CCP10IP_MASK                        equ 0080h
IPR4_CCIP3IP_POSN                        equ 0000h
IPR4_CCIP3IP_POSITION                    equ 0000h
IPR4_CCIP3IP_SIZE                        equ 0001h
IPR4_CCIP3IP_LENGTH                      equ 0001h
IPR4_CCIP3IP_MASK                        equ 0001h

// Register: PIE5
#define PIE5 PIE5
PIE5                                     equ 0F91h
// bitfield definitions
PIE5_TMR1GIE_POSN                        equ 0000h
PIE5_TMR1GIE_POSITION                    equ 0000h
PIE5_TMR1GIE_SIZE                        equ 0001h
PIE5_TMR1GIE_LENGTH                      equ 0001h
PIE5_TMR1GIE_MASK                        equ 0001h
PIE5_TMR5GIE_POSN                        equ 0001h
PIE5_TMR5GIE_POSITION                    equ 0001h
PIE5_TMR5GIE_SIZE                        equ 0001h
PIE5_TMR5GIE_LENGTH                      equ 0001h
PIE5_TMR5GIE_MASK                        equ 0002h
PIE5_TMR5IE_POSN                         equ 0002h
PIE5_TMR5IE_POSITION                     equ 0002h
PIE5_TMR5IE_SIZE                         equ 0001h
PIE5_TMR5IE_LENGTH                       equ 0001h
PIE5_TMR5IE_MASK                         equ 0004h
PIE5_TMR6IE_POSN                         equ 0003h
PIE5_TMR6IE_POSITION                     equ 0003h
PIE5_TMR6IE_SIZE                         equ 0001h
PIE5_TMR6IE_LENGTH                       equ 0001h
PIE5_TMR6IE_MASK                         equ 0008h
PIE5_TMR8IE_POSN                         equ 0004h
PIE5_TMR8IE_POSITION                     equ 0004h
PIE5_TMR8IE_SIZE                         equ 0001h
PIE5_TMR8IE_LENGTH                       equ 0001h
PIE5_TMR8IE_MASK                         equ 0010h
PIE5_CM3IE_POSN                          equ 0005h
PIE5_CM3IE_POSITION                      equ 0005h
PIE5_CM3IE_SIZE                          equ 0001h
PIE5_CM3IE_LENGTH                        equ 0001h
PIE5_CM3IE_MASK                          equ 0020h

// Register: TRISA
#define TRISA TRISA
TRISA                                    equ 0F92h
// bitfield definitions
TRISA_TRISA0_POSN                        equ 0000h
TRISA_TRISA0_POSITION                    equ 0000h
TRISA_TRISA0_SIZE                        equ 0001h
TRISA_TRISA0_LENGTH                      equ 0001h
TRISA_TRISA0_MASK                        equ 0001h
TRISA_TRISA1_POSN                        equ 0001h
TRISA_TRISA1_POSITION                    equ 0001h
TRISA_TRISA1_SIZE                        equ 0001h
TRISA_TRISA1_LENGTH                      equ 0001h
TRISA_TRISA1_MASK                        equ 0002h
TRISA_TRISA2_POSN                        equ 0002h
TRISA_TRISA2_POSITION                    equ 0002h
TRISA_TRISA2_SIZE                        equ 0001h
TRISA_TRISA2_LENGTH                      equ 0001h
TRISA_TRISA2_MASK                        equ 0004h
TRISA_TRISA3_POSN                        equ 0003h
TRISA_TRISA3_POSITION                    equ 0003h
TRISA_TRISA3_SIZE                        equ 0001h
TRISA_TRISA3_LENGTH                      equ 0001h
TRISA_TRISA3_MASK                        equ 0008h
TRISA_TRISA5_POSN                        equ 0005h
TRISA_TRISA5_POSITION                    equ 0005h
TRISA_TRISA5_SIZE                        equ 0001h
TRISA_TRISA5_LENGTH                      equ 0001h
TRISA_TRISA5_MASK                        equ 0020h
TRISA_TRISA6_POSN                        equ 0006h
TRISA_TRISA6_POSITION                    equ 0006h
TRISA_TRISA6_SIZE                        equ 0001h
TRISA_TRISA6_LENGTH                      equ 0001h
TRISA_TRISA6_MASK                        equ 0040h
TRISA_TRISA7_POSN                        equ 0007h
TRISA_TRISA7_POSITION                    equ 0007h
TRISA_TRISA7_SIZE                        equ 0001h
TRISA_TRISA7_LENGTH                      equ 0001h
TRISA_TRISA7_MASK                        equ 0080h

// Register: TRISB
#define TRISB TRISB
TRISB                                    equ 0F93h
// bitfield definitions
TRISB_TRISB0_POSN                        equ 0000h
TRISB_TRISB0_POSITION                    equ 0000h
TRISB_TRISB0_SIZE                        equ 0001h
TRISB_TRISB0_LENGTH                      equ 0001h
TRISB_TRISB0_MASK                        equ 0001h
TRISB_TRISB1_POSN                        equ 0001h
TRISB_TRISB1_POSITION                    equ 0001h
TRISB_TRISB1_SIZE                        equ 0001h
TRISB_TRISB1_LENGTH                      equ 0001h
TRISB_TRISB1_MASK                        equ 0002h
TRISB_TRISB2_POSN                        equ 0002h
TRISB_TRISB2_POSITION                    equ 0002h
TRISB_TRISB2_SIZE                        equ 0001h
TRISB_TRISB2_LENGTH                      equ 0001h
TRISB_TRISB2_MASK                        equ 0004h
TRISB_TRISB3_POSN                        equ 0003h
TRISB_TRISB3_POSITION                    equ 0003h
TRISB_TRISB3_SIZE                        equ 0001h
TRISB_TRISB3_LENGTH                      equ 0001h
TRISB_TRISB3_MASK                        equ 0008h
TRISB_TRISB4_POSN                        equ 0004h
TRISB_TRISB4_POSITION                    equ 0004h
TRISB_TRISB4_SIZE                        equ 0001h
TRISB_TRISB4_LENGTH                      equ 0001h
TRISB_TRISB4_MASK                        equ 0010h
TRISB_TRISB5_POSN                        equ 0005h
TRISB_TRISB5_POSITION                    equ 0005h
TRISB_TRISB5_SIZE                        equ 0001h
TRISB_TRISB5_LENGTH                      equ 0001h
TRISB_TRISB5_MASK                        equ 0020h
TRISB_TRISB6_POSN                        equ 0006h
TRISB_TRISB6_POSITION                    equ 0006h
TRISB_TRISB6_SIZE                        equ 0001h
TRISB_TRISB6_LENGTH                      equ 0001h
TRISB_TRISB6_MASK                        equ 0040h
TRISB_TRISB7_POSN                        equ 0007h
TRISB_TRISB7_POSITION                    equ 0007h
TRISB_TRISB7_SIZE                        equ 0001h
TRISB_TRISB7_LENGTH                      equ 0001h
TRISB_TRISB7_MASK                        equ 0080h

// Register: TRISC
#define TRISC TRISC
TRISC                                    equ 0F94h
// bitfield definitions
TRISC_TRISC0_POSN                        equ 0000h
TRISC_TRISC0_POSITION                    equ 0000h
TRISC_TRISC0_SIZE                        equ 0001h
TRISC_TRISC0_LENGTH                      equ 0001h
TRISC_TRISC0_MASK                        equ 0001h
TRISC_TRISC1_POSN                        equ 0001h
TRISC_TRISC1_POSITION                    equ 0001h
TRISC_TRISC1_SIZE                        equ 0001h
TRISC_TRISC1_LENGTH                      equ 0001h
TRISC_TRISC1_MASK                        equ 0002h
TRISC_TRISC2_POSN                        equ 0002h
TRISC_TRISC2_POSITION                    equ 0002h
TRISC_TRISC2_SIZE                        equ 0001h
TRISC_TRISC2_LENGTH                      equ 0001h
TRISC_TRISC2_MASK                        equ 0004h
TRISC_TRISC6_POSN                        equ 0006h
TRISC_TRISC6_POSITION                    equ 0006h
TRISC_TRISC6_SIZE                        equ 0001h
TRISC_TRISC6_LENGTH                      equ 0001h
TRISC_TRISC6_MASK                        equ 0040h
TRISC_TRISC7_POSN                        equ 0007h
TRISC_TRISC7_POSITION                    equ 0007h
TRISC_TRISC7_SIZE                        equ 0001h
TRISC_TRISC7_LENGTH                      equ 0001h
TRISC_TRISC7_MASK                        equ 0080h

